app/views/customers/show.html.erb

  <span class="form"><%= f.label :menu_item %></span>
  <%= f.collection_select :menu_item_id, MenuItem.all, :id, :name, class: "custom-dropdown" %>
---
SELECT "menu_items".* FROM "menu_items"