app/controllers/admins_controller.rb

  def show
    @menu_item = MenuItem.find params[:id]
---
SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = ? LIMIT 1  [["id", 0]]