app/controllers/customers_controller.rb

SELECT  1 AS one FROM "orders" WHERE "orders"."customer_id" = $1 LIMIT 1  [["customer_id", 21]]
---
  def destroy
    customer = Customer.find params[:id]
    # customer.destroy
    # redirect_to customers_path

    # tried but didn't work
    # customer.destroy[:customer.id]
    # customer.destroy(customer_params)


    if customer.orders.any?