app/controllers/customers_controller.rb

  def index
    @customers = Customer.all

    if session[:server_id]
      @server = Server.find session[:server_id]
---
SELECT "customers".* FROM "customers"
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", 2]]

  def show
    @customer = Customer.find params[:id]
    @order = Order.new

    if session[:server_id]
      @server = Server.find session[:server_id]
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @customer = Customer.find params[:id]

    if session[:server_id]
      @server = Server.find session[:server_id]
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", 1]]

  def update
    customer = Customer.find params[:id]
    customer.update customer_params
    redirect_to customers_path

    if session[:server_id]
      @server = Server.find session[:server_id]
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 10]]
UPDATE "customers" SET "server_id" = $1, "table_number" = $2, "seat_number" = $3, "updated_at" = $4 WHERE "customers"."id" = $5  [["server_id", 1], ["table_number", 0], ["seat_number", 2], ["updated_at", "2016-04-23 19:42:26.024441"], ["id", 11]]
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT 1  [["id", 1]]

  def new
    @customer = Customer.new
    # @server = current_server

    if session[:server_id]
      @server = Server.find session[:server_id]
---
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", 1]]

  def create
    customer = Customer.create customer_params
    redirect_to customers_path

    if session[:server_id]
      @server = Server.find session[:server_id]
---
INSERT INTO "customers" ("server_id", "table_number", "seat_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["server_id", 1], ["table_number", 0], ["seat_number", 2], ["created_at", "2016-04-22 20:58:52.147632"], ["updated_at", "2016-04-22 20:58:52.147632"]]
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", 2]]

  def destroy
    customer = Customer.find params[:id]
    customer.destroy
    redirect_to customers_path

    if session[:server_id]
      @server = Server.find session[:server_id]
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 1]]
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT 1  [["id", 1]]