app/controllers/menu_items_controller.rb

SELECT "menu_items".* FROM "menu_items"
---
  def index
    @menu_items = MenuItem.all

INSERT INTO "menu_items" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["description", ""], ["created_at", "2016-04-23 20:33:59.262404"], ["updated_at", "2016-04-23 20:33:59.262404"]]
---
  def create
    menu_item = MenuItem.create menu_item_params

SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT 1  [["id", 3]]
---
  def edit
    @menu_item = MenuItem.find params[:id]

SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @menu_item = MenuItem.find params[:id]

SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "menu_items" SET "name" = $1, "updated_at" = $2 WHERE "menu_items"."id" = $3  [["name", "Sturgeon Nails"], ["updated_at", "2016-04-23 18:01:20.168890"], ["id", 3]]
---
  def update
    menu_item = MenuItem.find params[:id]
    menu_item.update menu_item_params

SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "orders" WHERE "orders"."menu_item_id" = $1 LIMIT 1  [["menu_item_id", 14]]
DELETE FROM "menu_items" WHERE "menu_items"."id" = $1  [["id", 1]]
---
  def destroy
    # MenuItem.destroy params[:id]
    # redirect_to menu_items_path

    menu_item = MenuItem.find params[:id]

    if menu_item.orders.any?
      flash[:error] = "Can't 86 menu item - open orders"
      redirect_to menu_items_path
    else
      menu_item.destroy!