app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @order = Order.find params[:id]

INSERT INTO "orders" ("server_id", "menu_item_id", "customer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["server_id", 1], ["menu_item_id", 4], ["customer_id", 1], ["created_at", "2016-04-23 20:34:50.857067"], ["updated_at", "2016-04-23 20:34:50.857067"]]
---
  def create
    order = Order.create!(order_params)