app/controllers/servers_controller.rb

  def create
    server = Server.create server_params
---
INSERT INTO "servers" ("username", "password_digest", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def profile
    if session[:server_id]
      @server = Server.find session[:server_id]
---
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", 1]]