app/controllers/sessions_controller.rb

SELECT  "servers".* FROM "servers" WHERE "servers"."username" = ? LIMIT 1  [["username", "veronica"]]
---
  def create
    username = params[:username]
    password = params[:password]

    server = Server.find_by username: username